Revit 2027 API
ExtendedPropertiesLinkValues.AddValue(ForgeTypeId, Double) Method
 Add a double value for a given schema id.
Namespace: Autodesk.Revit.DB.ExternalData
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool AddValue(
	ForgeTypeId schemaId,
	double value
)
Public Function AddValue (
	schemaId As ForgeTypeId,
	value As Double
) As Boolean
public:
bool AddValue(
	ForgeTypeId^ schemaId,
	double value
)
member AddValue :
        schemaId : ForgeTypeId *
        value : float -> bool
Parameters
schemaId ForgeTypeId
 Identifier of the schema.
value Double
 The double value in the storage unit of schema.
Return Value
Boolean
 True if the data was added, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExtendedPropertiesLinkValues Class
AddValue Overload
Autodesk.Revit.DB.ExternalData Namespace